In [20]:
people = {
    "first": ["Sueda", 'Jane', 'John'], 
    "last": ["Ciftci", 'ozg', 'Doe'], 
    "email": ["sueda@gmail.com", 'edasu@email.com', 'doee@email.com']
}

In [21]:
import pandas as pd

In [22]:
df = pd.DataFrame(people)

In [25]:
df

   first    last            email
0  Sueda  Ciftci  sueda@gmail.com
1   Jane     ozg  edasu@email.com
2   John     Doe   doee@email.com

In [27]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [29]:
df.columns = ['first_name', 'last_name', 'email']

In [30]:
df

  first_name last_name            email
0      Sueda    Ciftci  sueda@gmail.com
1       Jane       ozg  edasu@email.com
2       John       Doe   doee@email.com

In [36]:
#need to change something specific for one or more column
#for ex: i want t be my all columns are upper case
df.columns = [x.upper()for x in df.columns]
df

  FIRST_NAME LAST_NAME            EMAIL
0      Sueda    Ciftci  sueda@gmail.com
1       Jane       ozg  edasu@email.com
2       John       Doe   doee@email.com

In [41]:
#or replace the spces
df.columns = df.columns.str.replace('_', ' ')
df

  FIRST NAME LAST NAME            EMAIL
0      Sueda    Ciftci  sueda@gmail.com
1       Jane       ozg  edasu@email.com
2       John       Doe   doee@email.com

In [42]:
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME LAST_NAME            EMAIL
0      Sueda    Ciftci  sueda@gmail.com
1       Jane       ozg  edasu@email.com
2       John       Doe   doee@email.com

In [47]:
df.columns = [x.lower()for x in df.columns]
df

  first_name last_name            email
0      Sueda    Ciftci  sueda@gmail.com
1       Jane       ozg  edasu@email.com
2       John       Doe   doee@email.com

In [51]:
#if we want in same columns not all
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [52]:
df

   first    last            email
0  Sueda  Ciftci  sueda@gmail.com
1   Jane     ozg  edasu@email.com
2   John     Doe   doee@email.com

In [54]:
df.loc[2] = ['John', 'Donde', 'donde@email.com']
#specify the spacific row and change the info

In [55]:
df

   first    last            email
0  Sueda  Ciftci  sueda@gmail.com
1   Jane     ozg  edasu@email.com
2   John   Donde  donde@email.com

In [57]:
df.loc[2, ['last', 'email']] = ['Doe', 'donde@email.com']

In [58]:
df

   first    last            email
0  Sueda  Ciftci  sueda@gmail.com
1   Jane     ozg  edasu@email.com
2   John     Doe  donde@email.com

In [59]:
#change single value
df.loc[2, 'last'] = 'Smith'
df

In [65]:
#looking and changing single value other way, there in not much differences
df.at[2, 'last'] = 'Done'
df

   first    last            email
0  Sueda  Ciftci  sueda@gmail.com
1   Jane     ozg  edasu@email.com
2   John    Done  donde@email.com

In [68]:
filt = (df['email'] == 'donde@email.com')
df[filt]['last'] = 'Smith '
#[common mistakke] it didnt work here it try to change copy so it didnt

C:\Users\sueda\AppData\Local\Temp/ipykernel_10928/3294798400.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Smith '

In [71]:
filt = (df['email'] == 'donde@email.com')
df.loc[filt, 'last'] = 'Smith '
df

   first    last            email
0  Sueda  Ciftci  sueda@gmail.com
1   Jane     ozg  edasu@email.com
2   John  Smith   donde@email.com

In [73]:
df['email'].str.upper()

0    SUEDA@GMAIL.COM
1    EDASU@EMAIL.COM
2    DONDE@EMAIL.COM
Name: email, dtype: object

In [76]:
df['email'] = df['email'].str.lower()
df

   first    last            email
0  Sueda  Ciftci  sueda@gmail.com
1   Jane     ozg  edasu@email.com
2   John  Smith   donde@email.com

In [ ]:
#APPLY
#runnig apply to series applies a functuen to every value in the series
#running apply to a data frame applies every series in dataframe

In [77]:
df['email'].apply(len)

0    15
1    15
2    15
Name: email, dtype: int64

In [78]:
def update_email(email):
    return email.upper()

In [81]:
df['email'].apply(update_email)

0    SUEDA@GMAIL.COM
1    EDASU@EMAIL.COM
2    DONDE@EMAIL.COM
Name: email, dtype: object

In [84]:
df['email'] = df['email'].apply(update_email) #we assing taht column with that functuon for kalici change our rows on data dataframe
df

   first    last            email
0  Sueda  Ciftci  SUEDA@GMAIL.COM
1   Jane     ozg  EDASU@EMAIL.COM
2   John  Smith   DONDE@EMAIL.COM

In [87]:
#using lambda function
df['email'] = df['email'].apply(lambda x: x.lower())
df
#it can be used with number as well

   first    last            email
0  Sueda  Ciftci  sueda@gmail.com
1   Jane     ozg  edasu@email.com
2   John  Smith   donde@email.com

In [88]:
df['email'].apply(len)
#gets len of email's

0    15
1    15
2    15
Name: email, dtype: int64

In [89]:
df.apply(len)
#this gets how many values in each colum

first    3
last     3
email    3
dtype: int64

In [90]:
len(df['email'])
#how many value in email colums

3

In [91]:
#if we change the axix it can do in rows, it says 0 row has 3 values
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [93]:
# min value of each column, which one coe alp first for str data
df.apply(pd.Series.min)

first               Jane
last              Ciftci
email    donde@email.com
dtype: object

In [94]:
df.apply(lambda x: x.min())

first               Jane
last              Ciftci
email    donde@email.com
dtype: object

In [95]:
#we can apply  function to every individual element in the dataframe that here applymap 
#applymap only can be use in datafarames
df.applymap(len)

   first  last  email
0      5     6     15
1      4     3     15
2      4     6     15

In [96]:
 df.applymap(str.lower)
#if any int here will give error, thet write function

   first    last            email
0  sueda  ciftci  sueda@gmail.com
1   jane     ozg  edasu@email.com
2   john  smith   donde@email.com

In [ ]:
#MAP

In [97]:
df['first'].map({'Sueda': 'Su'})

0     Su
1    NaN
2    NaN
Name: first, dtype: object

In [99]:
#if we dont want to get rid of other rows (not be NaN) we can use eplace method
df['first'] = df['first'].replace({'Sueda': 'Su'})

In [100]:
df

  first    last            email
0    Su  Ciftci  sueda@gmail.com
1  Jane     ozg  edasu@email.com
2  John  Smith   donde@email.com